IDEA Open Model
BarEndExtendType Enumeration
Compatible with IDEA StatiCa 20.1
 Type of extension of bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum BarEndExtendType
Public Enumeration BarEndExtendType
Members
Member name | Value | Description
No | 0 |  No extension
ExtendToSegment | 1 |  Extension to the end of segment
ExtendByDistance | 2 |  Extension by distance
See Also
Reference
IdeaRS.OpenModel.Detail Namespace